xshan8333/micropython_tm4c/ports/tiva-c/mods/pybpin.c
/******************************************************************************
DEFINE PRIVATE FUNCTIONS
 ******************************************************************************/
STATIC pin_obj_t *pin_find_named_pin(const mp_obj_dict_t *named_pins, mp_obj_t name) {
    mp_map_t *named_map = mp_obj_dict_get_map((mp_obj_t)named_pins);
    mp_map_elem_t *named_elem = mp_map_lookup(named_map, name, MP_MAP_LOOKUP);
    if (named_elem != NULL && named_elem->value != NULL) {
        return named_elem->value;
    }
    return NULL;
}

STATIC pin_obj_t *pin_find_pin_by_port_bit (const mp_obj_dict_t *named_pins, uint port, uint bit) {
    mp_map_t *named_map = mp_obj_dict_get_map((mp_obj_t)named_pins);
    for (uint i = 0; i < named_map->used; i++) {
        if ((((pin_obj_t *)named_map->table[i].value)->port == port) &&
                (((pin_obj_t *)named_map->table[i].value)->bit == bit)) {
            return named_map->table[i].value;
        }
    }
    return NULL;
}

STATIC int8_t pin_obj_find_af (const pin_obj_t* pin, uint8_t fn, uint8_t unit, uint8_t type) {
    for (int i = 0; i < pin->num_afs; i++) {
        if (pin->af_list[i].fn == fn && pin->af_list[i].unit == unit && pin->af_list[i].type == type) {
            return pin->af_list[i].idx;
        }
    }
    return -1;
}

STATIC void pin_free_af_from_pins (uint8_t fn, uint8_t unit, uint8_t type) {
    mp_map_t *named_map = mp_obj_dict_get_map((mp_obj_t)&pin_board_pins_locals_dict);
    for (uint i = 0; i < named_map->used - 1; i++) {
        pin_obj_t * pin = (pin_obj_t *)named_map->table[i].value;
        // af is different than GPIO
        if (pin->af > GPIO_DIR_MODE_IN) {
            // check if the pin supports the target af
            int af = pin_obj_find_af(pin, fn, unit, type);
            if (af > 0 && af == pin->af) {
                // the pin supports the target af, de-assign it
                pin_deassign (pin);
            }
        }
    }
}

STATIC void pin_deassign (pin_obj_t* pin) {
    pin_config (pin, GPIO_DIR_MODE_IN, GPIO_PIN_TYPE_STD, -1, GPIO_STRENGTH_4MA);
    pin->used = false;
}

STATIC void pin_obj_configure (const pin_obj_t *self) {
    // enable the peripheral clock for the GPIO port of this pin
    switch (self->port) {
        case GPIO_PORTA_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
            break;
        case GPIO_PORTB_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
            break;
        case GPIO_PORTC_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
            break;
        case GPIO_PORTD_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
            break;
        case GPIO_PORTE_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
            break;
        case GPIO_PORTF_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
            break;
        case GPIO_PORTG_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
            break;
        case GPIO_PORTH_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
            break;
        case GPIO_PORTJ_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
            break;
        case GPIO_PORTK_BASE:
            MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
            break;
        default:
            break;
    }
    
    if (self->mode == GPIO_PIN_TYPE_ANALOG) {
        // now set the alternate function,configure the direction
        MAP_GPIODirModeSet(self->port, self->bit, GPIO_DIR_MODE_IN);
    } else {
        // now set the alternate function,configure the direction
        MAP_GPIODirModeSet(self->port, self->bit, self->af);
        // set the pin value
        if (self->value) {
            MAP_GPIOPinWrite(self->port, self->bit, self->bit);
        } else {
            MAP_GPIOPinWrite(self->port, self->bit, 0);
        }
        // now set the alternate function
        //MAP_PinModeSet (self->pin_num, self->af);
    }
    //MAP_PinConfigSet(self->pin_num, self->strength, type);
    MAP_GPIOPadConfigSet(self->port, self->bit, self->strength, self->mode);
}

//=================================================================================================
STATIC void pin_get_hibernate_pin_and_idx (const pin_obj_t *self, uint *hib_pin, uint *idx) {
    // pin_num is actually : (package_pin - 1)
#if 0
    switch (self->pin_num) {
    case 56:    // GP2
        *hib_pin = PRCM_HIB_GPIO2;
        *idx = 0;
        break;
    default:
        *idx = 0xFF;
        break;
    }
#endif
    *idx = 0xFF;
}

STATIC void pin_irq_enable (mp_obj_t self_in) {
    const pin_obj_t *self = self_in;
    uint hib_pin, idx;

    pin_get_hibernate_pin_and_idx (self, &hib_pin, &idx);
    if (idx < PYBPIN_NUM_WAKE_PINS) {
        if (pybpin_wake_pin[idx].lpds != PYBPIN_WAKES_NOT) {
            // enable GPIO as a wake source during LPDS
            MAP_PRCMLPDSWakeUpGPIOSelect(idx, pybpin_wake_pin[idx].lpds);
            MAP_PRCMLPDSWakeupSourceEnable(PRCM_LPDS_GPIO);
        }

        if (pybpin_wake_pin[idx].hib != PYBPIN_WAKES_NOT) {
            // enable GPIO as a wake source during hibernate
            MAP_PRCMHibernateWakeUpGPIOSelect(hib_pin, pybpin_wake_pin[idx].hib);
            MAP_PRCMHibernateWakeupSourceEnable(hib_pin);
        }
        else {
            MAP_PRCMHibernateWakeupSourceDisable(hib_pin);
        }
    }
    // if idx is invalid, the pin supports active interrupts for sure
    if (idx >= PYBPIN_NUM_WAKE_PINS || pybpin_wake_pin[idx].active) {
        MAP_GPIOIntClear(self->port, self->bit);
        MAP_GPIOIntEnable(self->port, self->bit);
    }
    // in case it was enabled before
    else if (idx < PYBPIN_NUM_WAKE_PINS && !pybpin_wake_pin[idx].active) {
        MAP_GPIOIntDisable(self->port, self->bit);
    }
}

STATIC void pin_irq_disable (mp_obj_t self_in) {
    const pin_obj_t *self = self_in;
    uint hib_pin, idx;

    pin_get_hibernate_pin_and_idx (self, &hib_pin, &idx);
    if (idx < PYBPIN_NUM_WAKE_PINS) {
        if (pybpin_wake_pin[idx].lpds != PYBPIN_WAKES_NOT) {
            // disable GPIO as a wake source during LPDS
            MAP_PRCMLPDSWakeupSourceDisable(PRCM_LPDS_GPIO);
        }
        if (pybpin_wake_pin[idx].hib != PYBPIN_WAKES_NOT) {
            // disable GPIO as a wake source during hibernate
            MAP_PRCMHibernateWakeupSourceDisable(hib_pin);
        }
    }
    // not need to check for the active flag, it's safe to disable it anyway
    MAP_GPIOIntDisable(self->port, self->bit);
}

